# 5. Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
# У пользователя необходимо запрашивать новый элемент рейтинга.
# Если в рейтинге существуют элементы с одинаковыми значениями,
# то новый элемент с тем же значением должен разместиться после них.


rating = [5, 4, 4, 3]

while True:
    number = input('Введите число: ')

    if number.isnumeric():
        rating.append(int(number))
        rating.sort(reverse=True)

        print(rating)

        if input('Продолжить ввод: ').lower() != 'y':
            break
